import { Paragraph } from "@/components/styled/Paragrph"
import { MainSection } from "../history/Section/MainSection"
import { LecturerInfo } from "../history/types"

const lecturerInfo: LecturerInfo = {
    imgSrc: "/src/static/img/provotar.png",
    name: "Провотар Олександр Іванович",
    post: "завідувач кафедри ІС доктор фізико-математичних наук, професор",
}

export const GreetingPage = () => {
    return <div className="flex flex-col gap-9">
        <h2 className="text-[52px] font-bold">Привітання завідувача кафедри</h2>
        <MainSection lecturerInfo={lecturerInfo}>
            <h3 className="text-3xl font-medium">Вітаю Вас на веб-сайті кафедри <br /> інтелектуальних програмних систем.</h3>
            <Paragraph>Кафедра є наймолодшою на факультеті комп'ютерних наук та кібернетики. Функціонує від травня 1990 року як кафедра загальної інформатики. У зв’язку із зміною тематики наукових досліджень 1 червня 1998 року кафедру було перейменовано на кафедру інформаційних систем (ІС). Пізніше, у зв'язку з уточненням тематики наукових досліджень, 8 травня 2019 року кафедру було перейменовано на кафедру інтелектуальних програмних систем.</Paragraph>
            <Paragraph>Кафедра готує бакалаврів та магістрів за спеціальністю <b>121 Інженерія програмного забезпечення</b> (ОС Бакалавр: освітня програма <b>Програмна інженерія</b>, ОС Магістр: освітня програма <b>Програмне забезпечення систем</b>).</Paragraph>
            <Paragraph>Ставши частиною великої факультетської родини і спеціалізуючись по нашій кафедрі ви познайомитесь з багатьма сучасними напрямками комп'ютерних наук та станете висококласними фахівцями в області інформаційних технологій та інженерії програмного забезпечення. Ваше майбутнє у ваших руках.</Paragraph>
        </MainSection>
    </div>
}