import { Divider } from "@/components/common/divider/Divider"

export const StudyPage = () => {
    // TODO: bold words inside paragraphs
    return <>
        <h2 className="font-bold text-5xl">Навчання</h2>
        <div className="flex flex-col gap-5">
            <h3 className="font-medium text-3xl">Освітній рівень “Бакалавр”</h3>
            <p className="font-light text-2xl">Кафедра інтелектуальних програмних систем проводить підготовку бакалаврів в галузі 12 Інформаційні технології за спеціальністю 121 Інженерія програмного забезпечення, освітня програма Програмна інженерія.</p>
            <p className="font-light text-2xl">Протягом навчання студенти мають змогу прослухати сучасні навчальні курси, які читають викладачі кафедри. Навчальні програми за якими проводиться підготовка бакалаврів складені з врахуванням досвіду провідних закордонних вищих навчальних закладів, таких як університети Кембріджа та Стендфорда.</p>
            <div>
                <p className="font-medium text-2xl mb-3">Детальна інформація:</p>
                <ul className="font-light text-2xl underline underline-offset-8 list-disc list-inside">
                    <li>Положення про організацію освітнього процесу у Київському національному університеті імені Тараса Шевченка</li>
                    <li>Правила прийому до Київського національного університету імені Тараса Шевченка.</li>
                    <li>Інформація про навчання на факультеті комп'ютерних наук та кібернетики.</li>
                </ul>
            </div>
        </div>
        <Divider />
        <div className="flex flex-col gap-5">
            <h3 className="font-medium text-3xl">Освітній рівень “Магістр”</h3>
            <p className="font-light text-2xl">Кафедра інтелектуальних програмних систем проводить підготовку магістрів у галузі 12 Інформаційні технології за спеціальністю 121 Інженерія програмного забезпечення, освітня програма Програмна інженерія.</p>
            <p className="font-light text-2xl">Протягом навчання студенти мають змогу прослухати сучасні навчальні курси, які читають викладачі кафедри. Навчальні програми за якими проводиться підготовка магістрів складені з врахуванням досвіду провідних закордонних вищих навчальних закладів, таких як університети Кембріджа та Стендфорда.</p>
        </div>
        <Divider />
        <div className="flex flex-col gap-5">
            <h3 className="font-medium text-3xl">Освітній рівень “Доктор філософії”</h3>
            <p className="font-light text-2xl">Кафедра інтелектуальних програмних систем проводить підготовку докторів філософії в галузі 12 Інформаційні технології за наступними спеціальностями: </p>
            <ul className="font-light text-2xl list-disc list-inside gap-2">
                    <li>121 Інженерія програмного забезпечення</li>
                    <li>122 Комп'ютерні науки та інформаційні технології</li>
                </ul>
            <div>
                <p className="font-medium text-2xl mb-3">Детальна інформація:</p>
                <ul className="font-light text-2xl underline underline-offset-8 list-disc list-inside">
                    <li>Положення про організацію освітнього процесу у Київському національному університеті імені Тараса Шевченка</li>
                    <li>Правила прийому до Київського національного університету імені Тараса Шевченка.</li>
                    <li>Інформація про навчання в аспірантурі факультету комп'ютерних наук та кібернетики</li>
                </ul>
            </div>
        </div>
    </>
}