export const navigationData = [
    {
        title: "Про кафедру",
        points: ["Про кафедру", "Привітання завідувача", "Історія кафедри", "Співробітники", "Працевлаштування", "Випускники кафедри"],
    },
    {
        title: "Навчання",
        points: ["Навчання", "ОС “Бакалавр”", "ОС “Магістр”", "ОС “Доктор філософії”", "Навчальна література", "Курсові та дипломні роботи"]
    },
    {
        title: "Абітурієнтам",
        points: ["Абітурієнтам", "ОС “Бакалавр”", "ОС “Магістр", "Правила прийому"]
    },
    {
        title: "Наука",
        points: ["Наука (Наукова робота)", "Аспірантура", "Докторантура", "Дисертації", "Науковий семінар", "Наукові конференції", "Публікації кафдери"]
    },
    {
        title: "Бібліотека",
        points: ["Бібліотека", "Підручники", "Монографії", "Навчальні посібники", "Методичні рекомендації", "Науково-пошукові системи", "Наукові бібліотеки", "Наукові журнали", "Наукові організації", "Самоосвіта"]
    },
    {
        title: "Контакти",
    },

]
